app/controllers/admins_controller.rb

  def index
    @admins = Admin.all
---
SELECT "admins".* FROM "admins"

    def set_admin
      @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]