app/controllers/employees_controller.rb

INSERT INTO "employees" ("idEmployee", "passwordEmployee", "emailEmployee", "nameEmployee", "remainingLeave", "adressEmployee", "phoneEmployee", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "nameEmployee" = ?, "adressEmployee" = ?, "phoneEmployee" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["nameEmployee", "francois"], ["adressEmployee", ""], ["phoneEmployee", 55626533], ["updated_at", "2018-07-26 10:39:46.116129"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)