app/controllers/leave_requests_controller.rb

SELECT "leave_requests".* FROM "leave_requests"
---
  def index
    @leave_requests = LeaveRequest.all

INSERT INTO "leave_requests" ("startDate", "endDate", "reason", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["startDate", "2018-07-26 11:31:00"], ["endDate", "2018-07-26 11:31:00"], ["reason", ""], ["status", 0], ["created_at", "2018-07-26 11:31:38.637303"], ["updated_at", "2018-07-26 11:31:38.637303"]]
---
  def create
    @leave_request = LeaveRequest.new(leave_request_params)

    respond_to do |format|
      if @leave_request.save

SELECT  "leave_requests".* FROM "leave_requests" WHERE "leave_requests"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_leave_request
      @leave_request = LeaveRequest.find(params[:id])